In [1]:
print("hello, panda!")

hello, panda!

In [4]:
#First thing: Series!
#Index->
import numpy as np,pandas as pd
print("ok, done!")

ok, done!

In [11]:
pd.Series
#data and index are the main important things.
myindex = ['USA','Canada', 'Mexico']
mydata =[1776,1867,1821]
myseries = pd.Series(data=mydata,index=myindex)
myseries
#Like a dictionary!
myseries['USA']
myseries[0]

1776

In [14]:
#like dictionaries too:
ages = {'Sam':5, 'Frank':10,'Spike':7}
print(ages)
pd.Series(ages)

{'Sam': 5, 'Frank': 10, 'Spike': 7}

Sam       5
Frank    10
Spike     7
dtype: int64

In [15]:
# Imaginary Sales Data for 1st and 2nd Quarters for Global Company
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}
sales_q1=pd.Series(q1)
sales_q2=pd.Series(q2)

In [16]:
sales_q1['Japan']

80

In [17]:
sales_q2[0]

100

In [18]:
#Operations between Series
sales_q1*sales_q2

Brazil         NaN
China     225000.0
India      42000.0
Japan          NaN
USA        65000.0
dtype: float64

In [23]:
sales_q1/2
#Lets use other commands!Ihuuu!
#To fill value, we determine the default value in case there is no value in one of the columns
#It will substitute de value when there is no value for a certain index.
sales_q1.add(sales_q2,fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [24]:
#While Doing operations between Series, it makes the operations according to the indexes.
#DATA FRAMES
#Create data frame
#Grab column/row
#Operations
#Lets create a random data
np.random.seed(101)
mydata=np.random.randint(0,101,(4,3))

In [25]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [38]:
myindex = ['PE','RN','MG','BA']
mycolumns = ['Jan','Feb','Mar']
df = pd.DataFrame(data=mydata,index=myindex,columns=mycolumns)
#other important methods to use.
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, PE to BA
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int64
 1   Feb     4 non-null      int64
 2   Mar     4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

             Jan        Feb        Mar
count   4.000000   4.000000   4.000000
mean   70.000000  21.750000  77.000000
std    22.730303  27.657127  10.198039
min    40.000000   4.000000  63.000000
25%    62.500000   7.750000  73.500000
50%    72.500000  10.000000  79.000000
75%    80.000000  24.000000  82.500000
max    95.000000  63.000000  87.000000

In [51]:
#csv -> comma separable variable!Wooooow!
#Where is your python file is located, and where is my python code located?

In [53]:
#How to open csv files?Easy peasy!
df = pd.read_csv('tips.csv')
df.head(10)
df.tail(10)
df.describe()
#SOme nice commands
df.columns
df.index
df.info()
#Another method. transpose will exchange the position of the column names for the index names(rows)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [59]:
#This will define a series for the column total_bill
df['total_bill'].head(10)
pd.core.series.Series

pandas.core.series.Series

In [61]:
#We can split the data frame in one or more series
#Example for two columns
mycols=['total_bill','tip']
df[mycols]
#lets now create a new column to calculate the percentage of tips in relation to the total bill:
100*df['tip']/df['total_bill']

0       5.944673
1      16.054159
2      16.658734
3      13.978041
4      14.680765
         ...
239    20.392697
240     7.358352
241     8.822232
242     9.820426
243    15.974441
Length: 244, dtype: float64

In [62]:
#So lets create a new column with that data
df['tip_percentage']=100*df['tip']/df['total_bill']

In [63]:
df.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679,18.623962
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985,22.805017
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157,11.607143
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,13.031915
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,21.853857

In [65]:
#If you reference a column that already exists and assign new values, they will be overwritten.
#example-we sont run it
#df['price_per_person']=df['total_bill']/df['size']
#Lets use some universal functions to round out the values of a column
df['price_per_person']=np.round(df['total_bill']/df['size'],2)

In [66]:
df.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679,18.623962
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985,22.805017
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157,11.607143
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,13.031915
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,21.853857

In [70]:
#we can also drop a column, by using the command drop:
df.drop('tip_percentage',axis=1)
#this does not work at the frame!It is not a permanent change!
#You can check by the commands below
df.info()
df.head()
#If you want to do a permanent change, so we should do:
#Its better than use inplace to do it. This is more commom!
df=df.drop('tip_percentage',axis=1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
 11  tip_percentage    244 non-null    float64
dtypes: float64(4), int64(2), object(6)
memory usage: 23.0+ KB

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [71]:
df.shape

(244, 12)

In [72]:
df.shape[0]

244

In [73]:
df.shape[1]

12

In [89]:
#Now lets talk about Indexes!
#Lets take a look at the data using indexes:
#Indexes should be an unique identifier for each row. Its the primary index in SQL. :)
#This will do it for us!
df.index
#df.set_index("Payment ID")
#It does not accept _!that is weird.
df.head(10)
#Lets do it permanent by:
#df = df.set_index("Payment ID")
#We can also reset our indexes using:
df.reset_index()
#This will set the Payment ID as a column and reset which is the index

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
tip_percentage                5.944673
Name: Sun2959, dtype: object

In [94]:
#Lets grab only a row. We should use:
df.iloc[0]
df.head(10)
#We can also refer to the payment ID value
df.loc['Sun2959']
#and voilá, we would have the same result!:)

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
tip_percentage                5.944673
Name: Sun2959, dtype: object

In [99]:
#Now we want to get a labeled list, so we can do the following way:
df.loc[['Sun2959','Sun5260']]
#Now if we want to drop or add rows, we can do:
df.drop('Sun2959',axis=0)
#this change is not permanent.
#df.head(10)
#If we want to do it permament...
df=df.drop('Sun2959',axis=0)

In [101]:
df.head()
#And it is gone!!
#Now lets use a slice!
#(Lets not run that)
#df=df.iloc[1:x]
#To add a new row---we need to have the first amount of columns. Be attentive!
#Lets assign to a row, first, the first row
one_row=df.iloc[0]
one_row

total_bill                     10.34
tip                             1.66
sex                             Male
smoker                            No
day                              Sun
time                          Dinner
size                               3
price_per_person                3.45
Payer Name            Douglas Tucker
CC Number           4478071379779230
tip_percentage             16.054159
Name: Sun4608, dtype: object

In [104]:
df=df.append(one_row)
#append will be deprecated, and its better to use other methods, such as:
#1. make a list out of the tables and then creating a new data frame.
#2.To use concat.
#Examples: https://stackoverflow.com/questions/70837397/good-alternative-to-pandas-append-method-now-that-it-is-being-deprecated

/tmp/ipykernel_1231607/711828457.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(one_row)

In [130]:
#USING FILTERS AND CONDITIONS WITH PANDAS
#rows are instances of the data
#This way we can do conditional filtering with pandas
#df[df["Pop"]>50]
#Filter by single condition, multiple conditions and check agains multiple possible values
#Lets do this!
#Lets first re-open the df original:
df = pd.read_csv('tips.csv')
df['total_bill']>40
#It does the comparsion for every row and write it as true or false for each row compared
#Series of a boolean values!
bool_series=df['total_bill']>40
#So we can pass the boolean series as an index parameter, so we can have only the rows which matches our conditions:
df[bool_series]
#we can also do it directly as:
df[df['total_bill']>40]
#easy peasy and logical.
df[df['sex']=='Male']
#Another one:
df[df['size']>3]

#What about multiple conditions?
#Lets do and & an or || same as C, it seems :)
df[(df['size']>3) & (df['sex']=='Male')]
#and key-word is just used for boolean values. Python is not smart enough to compare entire series
#Very very nice. :)
df[(df['day']=='Sun') | (df['sex']=='Female')].head(10)
#Another method which is very useful, is the "isin method...list of options"
options=['Sat','Sun']
df[df['day'].isin(options)]
#Easy peasy.

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17